var data=[];

var dataStr="1、大话西游<br>\
<br>\
导演:刘镇伟<br>\
编剧:技安（刘镇伟）<br>\
制片人:周星驰<br>\
类型:爱情，动作，奇幻 ，冒险，喜剧，悲剧<br>\
主演:周星驰，吴孟达，朱茵，莫文蔚，蓝洁瑛，罗家英，刘镇伟，蔡少芬，江约诚，陆树铭，吴珏瑾<br>\
片长:第一部96min，第二部105min<br>\
<br>\
<br>\
2、逃学威龙1<br>\
<br>\
导演: 陈嘉上<br>\
编剧:技安（刘镇伟）<br>\
制片人:周星驰<br>\
类型:喜剧<br>\
主演: 周星驰，吴孟达，张敏<br>\
片长: 101分钟 <br>\
<br>\
<br>\
3、逃学威龙2<br>\
<br>\
导演: 陈嘉上<br>\
编剧: 向华强，向华胜<br>\
制片人: 向华胜，向华强<br>\
类型: 喜剧、校园、动作<br>\
主演: 周星驰，朱茵，吴孟达，张敏<br>\
片长: 97分钟 <br>\
<br>\
<br>\
4、逃学威龙3<br>\
<br>\
导演: 王晶<br>\
编剧: 王晶<br>\
制片人: 李美嫦<br>\
类型: 喜剧，动作<br>\
主演: 周星驰，张敏，梅艳芳，陈百祥，周海媚，黄秋生<br>\
片长: 90min <br>\
<br>\
<br>\
5、食神<br>\
<br>\
导演: 周星驰 、李力持<br>\
编剧: 周星驰、谷德昭 、曾谨昌<br>\
制片人: 周星驰、杨国辉<br>\
类型: 喜剧，动作<br>\
主演: 周星驰，莫文蔚，刘以达，吴孟达，薛家燕，谷德昭，李兆基<br>\
片长: 96分钟 <br>\
<br>\
<br>\
6、回魂夜<br>\
<br>\
导演: 刘镇伟<br>\
编剧: 刘镇伟<br>\
制片人: 夏泽信<br>\
类型: 喜剧， 奇幻，恐怖<br>\
主演: 周星驰，莫文蔚，李健仁，黄一飞，卢雄，李力持<br>\
片长: 87分钟 <br>\
<br>\
<br>\
7、武状元苏乞儿<br>\
<br>\
导演: 陈嘉上，林德禄<br>\
编剧: 陈建忠<br>\
制片人: 夏泽信<br>\
类型: 喜剧，动作<br>\
主演: 周星驰，张敏，吴孟达，陈百祥，徐少强，秦沛<br>\
片长: 90min <br>\
<br>\
<br>\
8、九品芝麻官<br>\
<br>\
导演: 王晶<br>\
编剧: 王晶<br>\
制片人: 夏泽信<br>\
类型: 喜剧，动作<br>\
主演: 周星驰，张敏，吴孟达，钟丽缇，徐锦江，蔡少芬，吴启华，苑琼丹<br>\
片长: 90min <br>\
<br>\
<br>\
9、千王之王2000<br>\
<br>\
导演: 王晶<br>\
编剧: 王晶<br>\
制片人: 夏泽信<br>\
类型: 喜剧，动作<br>\
主演: 周星驰，张家辉，刘以达，Nick Cheung，关秀媚，李兆基<br>\
片长: 90min <br>\
<br>\
<br>\
10、喜剧之王<br>\
<br>\
导演: 周星驰，李力持<br>\
编剧: 曾谨昌，周星驰<br>\
制片人: 胡素玲<br>\
类型: 剧情，喜剧，爱情<br>\
主演: 周星驰，莫文蔚，张柏芝，吴孟达，林子善，田启文，李兆基，成龙<br>\
片长: 90min <br>\
<br>\
<br>\
11、国产凌凌漆<br>\
<br>\
导演: 周星驰，李力持<br>\
编剧: 周星驰、谷德昭、李力持<br>\
制片人: 向华强<br>\
类型: 动作<br>\
主演: 周星驰，袁咏仪，罗家英，陈宝莲，黄锦江，郑祖<br>\
片长: 90min <br>\
<br>\
<br>\
12、整蛊专家<br>\
<br>\
导演: 王晶<br>\
编剧: 王晶<br>\
制片人: 胡兆昌<br>\
类型: 喜剧<br>\
主演: 周星驰，刘德华，邱淑贞，关之琳<br>\
片长: 90min <br>\
<br>\
<br>\
13、唐伯虎点秋香<br>\
<br>\
导演: 周星驰，李力持<br>\
编剧: 陈文强，谷德昭，李力持<br>\
制片人: 萧若元，向华强，向华胜<br>\
类型: 古装，喜剧，爱情<br>\
主演: 周星驰，巩俐，陈百祥，朱咪咪，郑佩佩，吴镇宇，黄一山<br>\
片长: 90min <br>\
<br>\
<br>\
14、破坏之王<br>\
<br>\
导演: 周星驰<br>\
编剧: 谷德昭，周星驰<br>\
制片人: 夏泽信<br>\
类型: 喜剧，动作<br>\
主演: 周星驰，钟丽缇，吴孟达，林国斌，黄一飞，古巨基，黄一山，张学友，林雪，郑祖<br>\
片长: 90min <br>\
<br>\
<br>\
15、大内密探零零发<br>\
<br>\
导演: 周星驰<br>\
编剧: 周星驰，谷德昭，劳文生<br>\
制片人: 向华强<br>\
类型: 喜剧，动作，剧情，爱情<br>\
主演: 周星驰，刘嘉玲，李若彤，罗家英，张达明，李力持，江欣燕，苑琼丹<br>\
片长: 90min <br>\
<br>\
<br>\
16、百变星君<br>\
<br>\
导演: 叶伟民<br>\
编剧: 王晶，叶伟民<br>\
制片人: 向华强<br>\
类型: 喜剧，科幻，奇幻<br>\
主演: 周星驰，梁咏琪，吴孟达，徐锦江，孙佳君，江欣燕，李健仁，郑祖<br>\
片长: 90min <br>\
<br>\
<br>\
17、审死官<br>\
<br>\
导演: 杜琪峰<br>\
编剧: 邵丽琼<br>\
制片人: 向华强<br>\
类型: 喜剧<br>\
主演: 周星驰，梅艳芳，吴家丽，吴孟达，秦沛，黄一飞<br>\
片长: 90min <br>\
<br>\
<br>\
18、济公<br>\
<br>\
导演: 杜琪峰，程小东<br>\
编剧: 邵丽琼<br>\
制片人: 向华强<br>\
类型: 喜剧<br>\
主演: 周星驰，张曼玉，吴孟达，黄秋生，梅艳芳，苑琼丹，黄志强<br>\
片长: 90min <br>\
<br>\
<br>\
19、算死草<br>\
<br>\
导演: 马伟豪<br>\
编剧: 马伟豪，黄浩华<br>\
制片人: 向华强<br>\
类型: 喜剧<br>\
主演: 周星驰，莫文蔚，邱淑贞，葛民辉，李兆基，林保怡<br>\
片长: 90min <br>\
<br>\
<br>\
20、家有喜事<br>\
<br>\
导演: 高志森<br>\
编剧: 黄百鸣 ，谷德昭，张肇麟<br>\
制片人: 罗杰承，黄百鸣<br>\
类型: 喜剧<br>\
主演: 张国荣，周星驰，张曼玉，黄百鸣，毛舜筠，吴君如<br>\
片长: 90min <br>\
";
var d=dataStr.split("<br><br><br>");
for (var i = 0; i < d.length; i++) {
	var c=d[i].split("<br><br>");
	data.push({
		img:c[0].replace("、"," ")+".jpg",
		caption:c[0].split("、")[1],
		desc:c[1]
	})
}